a = 'айдар 520 арлен вечер 2476 опер ми йонг 743 тофик 487 кариш 1480 исла 597 дондон 102 керим 1017 атай мика 1864 алишер 395 улар 16 кай 4821 даня три девять 963 дося лев 1614 аза 1143 ахма 1149 эржан 250 саян 325 улик 2643 айдар улик 227 олимжон 2568 нурболинио 388 исхак 77 иса 2693 улукман 594 эльзар 421 аким 1326 алым 131 бека 803 атай дж 1045 нурс 1383 эрбол  412 рама 1328 стам 122 аман 680 асхат  1428 паша 69 айдар б 1151 мика 1075 даир б 1274 тима сауле 25 уборка 205 назгуль 500'
list_ = a.split(' ')
num = []
for i in list_:
    if i.isdigit():
        number = int(i)
        num.append(number)

print(sum(num))